# 중복데이터를 삭제해야 하는 경우  
제공받은 데이터의 행데이터가 중복을 허용하지 말아야 하는 경우라면 식별을 해서 삭제를 해야 한다.

In [1]:
import pandas as pd

In [2]:
# 예제 데이터프레임 생성
data = {
    '이름': ['철수', '영희', '민수', '철수', '지수', '민수'],
    '나이': [25, 30, 35, 25, 40, 35],
    '도시': ['서울', '부산', '대구', '서울', '인천', '대구']
}

df = pd.DataFrame(data)
df

   이름  나이  도시
0  철수  25  서울
1  영희  30  부산
2  민수  35  대구
3  철수  25  서울
4  지수  40  인천
5  민수  35  대구

# 중복값 찾기

* 전체 행에 적용

In [3]:
df.duplicated()

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

* 특정 열을 기준으로 적용

In [4]:
df.duplicated(subset=['이름'])

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

* 중복값이 발생한 행데이터 보기

In [5]:
df[df.duplicated(keep=False)]

   이름  나이  도시
0  철수  25  서울
2  민수  35  대구
3  철수  25  서울
5  민수  35  대구

* 원본을 포함하여 중복값이 발생한 모든 행데이터 보기

# 중복값 삭제

* 원본을 유지한 형태로 삭제

In [6]:
df.drop_duplicates()

   이름  나이  도시
0  철수  25  서울
1  영희  30  부산
2  민수  35  대구
4  지수  40  인천

In [7]:
df

   이름  나이  도시
0  철수  25  서울
1  영희  30  부산
2  민수  35  대구
3  철수  25  서울
4  지수  40  인천
5  민수  35  대구

In [8]:
df_cleaned=df.drop_duplicates()
df_cleaned

   이름  나이  도시
0  철수  25  서울
1  영희  30  부산
2  민수  35  대구
4  지수  40  인천

* 원본에 중복값 삭제후 업데이트